_posts/2014-11-19-hello-and-self-introduction.html
---
collections: post
layout: post
title: Hello and Self-Introduction
date: 2014-11-19
categories: 
-
tags: 
- hello
- self-introduction
author: carltonf
excerpt: 
---
<p>
A "Hello World" blog. Later it would grow into Page "About".
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About Me (Philosophy matters)</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm an tech enthusiast with a business-like perspective towards the world.
</p>

<p>
To me, there are only two things that matter: one that's interesting, the other
that's profitable.
</p>

<p>
All the happiness and sadness arises from the fact: the only way to understand
an objective world is through the subjective mind.
</p>

<p>
In the last but not the least, I am a programmer ;P
</p>

<p>

</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">About me</h2>
<div class="outline-text-2" id="text-2">
<p>
I have a <a href="https://cn.linkedin.com/pub/chao-xiong/16/164/480">Linkedin profile</a>, which says much about my education and career so far.
</p>

<p>
I am a Chinese and currently living in Beijing.
</p>

<p>
That's basically all.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">About this blog</h2>
<div class="outline-text-2" id="text-3">
<p>
My interests are broad but this blog site would be a mostly programming-related
one. Basically everything about my work, my hobby project and etc.
</p>

<p>
I'd like short blog and regular posting.
</p>

<p>
This blog also serves a wiki for me ;P and in sharing them, I hope it would be
useful to others as well.
</p>
</div>
</div>
